#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ami.ubuntu: Reading...
data.aws_ssm_parameter.ssh_key: Reading...
aws_iam_policy.ssm_bastion_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-bastion-policy-dev]
aws_iam_role.bastion_role: Refreshing state... [id=rs-bastion-role-dev]
aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/flow-logs]
aws_kms_key.cloudwatch: Refreshing state... [id=fca54338-68d4-4097-afa6-fb45ab46dea3]
aws_iam_policy.ssm_controlplane_write_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-controlplane-write-policy-dev]
aws_iam_role.worker_role: Refreshing state... [id=rs-worker-role-dev]
aws_iam_policy.ssm_controlplane_read_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-controlplane-read-policy-dev]
aws_iam_role.controlplane_role: Refreshing state... [id=rs-controlplane-role-dev]
aws_iam_policy.ssm_worker_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-worker-policy-dev]
aws_eip.nat: Refreshing state... [id=eipalloc-011214f9aa46f3577]
aws_iam_role.vpc_flow_logs_role: Refreshing state... [id=rs-vpc-flow-logs-role-dev]
aws_vpc.main: Refreshing state... [id=vpc-0a25d5714ca877b58]
aws_iam_instance_profile.worker_profile: Refreshing state... [id=rs-worker-instance-profile-dev]
aws_iam_instance_profile.bastion_profile: Refreshing state... [id=rs-bastion-instance-profile-dev]
aws_iam_role_policy_attachment.ssm_bastion_policy_attach: Refreshing state... [id=rs-bastion-role-dev-20250626113451284500000004]
aws_iam_role_policy_attachment.ssm_controlplane_read_policy_attach: Refreshing state... [id=rs-controlplane-role-dev-20250626114159228800000002]
aws_iam_instance_profile.controlplane_profile: Refreshing state... [id=rs-controlplane-instance-profile-dev]
aws_iam_role_policy_attachment.ssm_controlplane_write_policy_attach: Refreshing state... [id=rs-controlplane-role-dev-20250626114159040800000001]
aws_iam_role_policy_attachment.ssm_worker_policy_attach: Refreshing state... [id=rs-worker-role-dev-20250626113451211100000003]
data.aws_ssm_parameter.ssh_key: Read complete after 1s [id=/development/ssh_key]
aws_iam_role_policy_attachment.vpc_flow_logs_policy: Refreshing state... [id=rs-vpc-flow-logs-role-dev-20250626113450958500000001]
local_file.ssh_key: Refreshing state... [id=4edc0d98a397011e99505d24aad17357304656d0]
data.aws_ami.ubuntu: Read complete after 2s [id=ami-0d4d7e98021b6b9a6]
aws_internet_gateway.igw: Refreshing state... [id=igw-0dd84e929ff74b5c4]
aws_flow_log.vpc_flow: Refreshing state... [id=fl-041c8c95edb370874]
aws_security_group.vm_private_sg: Refreshing state... [id=sg-077b7b3fa16ef6e0b]
aws_security_group.bastion_sg: Refreshing state... [id=sg-0c7eeec82d610f638]
aws_subnet.public[1]: Refreshing state... [id=subnet-0637c7d5a48f560e2]
aws_subnet.private[1]: Refreshing state... [id=subnet-093e3cdff34a68367]
aws_subnet.public[0]: Refreshing state... [id=subnet-09ceda498d6c18a11]
aws_subnet.private[0]: Refreshing state... [id=subnet-0cab0ba53483a05cb]
aws_security_group.vm_public_sg: Refreshing state... [id=sg-02ecc6225e043bebb]
aws_route_table.public: Refreshing state... [id=rtb-0570da3964ee29492]
aws_network_acl.private: Refreshing state... [id=acl-066699af7cb733503]
aws_instance.k3s_control_plane: Refreshing state... [id=i-09d46ba436c225dc5]
aws_instance.k3s_worker: Refreshing state... [id=i-0a4bb94cb2911df8c]
aws_nat_gateway.natgw: Refreshing state... [id=nat-01438abb8752b443c]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-077fd3d44e215f0d4]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0dc7432dad28cb065]
aws_network_acl.public: Refreshing state... [id=acl-06dbfca4d4e310ab0]
aws_instance.bastion: Refreshing state... [id=i-006c7ed5303939930]
aws_network_acl_rule.private_outbound_all: Refreshing state... [id=nacl-4099323282]
aws_network_acl_rule.private_inbound_all_vpc: Refreshing state... [id=nacl-1160472384]
aws_network_acl_rule.private_inbound_ephemeral: Refreshing state... [id=nacl-3942291813]
aws_network_acl_rule.private_inbound_icmp_vpc: Refreshing state... [id=nacl-1427487076]
aws_route_table.private: Refreshing state... [id=rtb-0d9c658df4b9a2f32]
aws_network_acl_rule.public_outbound_all: Refreshing state... [id=nacl-3720867706]
aws_network_acl_rule.public_inbound_all: Refreshing state... [id=nacl-3956513872]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05e1e54703a4295be]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0658a597f2409f708]
null_resource.provision_k3s_control_plane: Refreshing state... [id=600566279908790439]
null_resource.provision_k3s_worker: Refreshing state... [id=5427297228090358315]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_security_group.vm_public_sg will be updated in-place
  ~ resource "aws_security_group" "vm_public_sg" {
        id                     = "sg-02ecc6225e043bebb"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow all from VPC CIDR"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
            # (2 unchanged elements hidden)
        ]
        name                   = "rs-sg-public-vm-dev"
        tags                   = {
            "Name" = "rs-sg-public-vm-dev"
        }
        # (8 unchanged attributes hidden)
    }

  # local_file.ssh_key will be created
  + resource "local_file" "ssh_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./blackbird.pem"
      + id                   = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "output.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @isbelevtsov, Action: `pull_request`, Working Directory: `task_3/project`, Workflow: `Terraform Plan and Apply`*